{
  "lastSync": "2025-01-01",
  "source": "Google Business Profile",
  "totalCount": 54,
  "averageRating": 4.98,
  "reviews": [
    {
      "id": "review_001",
      "author": "Morris Bunyan",
      "rating": 5,
      "date": "2024-12-18",
      "relativeDate": "2 weeks ago",
      "text": "Was looking for a container, Seems to be lots of scams going on. Ended up googled companies and Read reviews on Mark. Definitely wasn't disappointed great guy to deal with sent pictures of container and was just as he described. His trucker he used was also great, took no time to drop off. Thanks again!!",
      "hasPhoto": false,
      "isNew": true,
      "ownerResponse": {
        "date": "2024-12-18",
        "text": "We appreciate you trusting a local family owned business for your container needs. We are so happy we could help you with your decision."
      }
    },
    {
      "id": "review_002",
      "author": "Victory Majors",
      "rating": 5,
      "date": "2024-11-01",
      "relativeDate": "2 months ago",
      "text": "I highly recommend this company they were and continue to be 10/10 top notch, they placed my containers exactly where they needed to be, more then helpful and I will definitely use them in the future. Great local company with great service. Thanks Mark",
      "hasPhoto": true,
      "ownerResponse": {
        "date": "2024-11-01",
        "text": "We appreciate you supporting a local trusted family company. We strive to make the difference when it comes to serving our customers."
      }
    },
    {
      "id": "review_003",
      "author": "Tanya Crichton",
      "rating": 5,
      "date": "2024-11-01",
      "relativeDate": "2 months ago",
      "text": "We give the staff at CcanSam 2 thumbs up! The customer service and communication with Mark was outstanding. He found us exactly what we asked for quickly. The quality of our 20 ft c-can is great and matches the color of our home. The timely delivery as well as the professional/careful placement of the c-can in our yard went seamlessly. We highly recommend CcanSam for your container needs!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-11-01",
        "text": "Thanks for your kind words and support. We were very happy to find you the perfect match for your house! Our delivery drivers are top notch, we're happy to hear everything went smoothly with your delivery too!"
      }
    },
    {
      "id": "review_004",
      "author": "spike laser art",
      "rating": 5,
      "date": "2024-11-01",
      "relativeDate": "2 months ago",
      "text": "Super easy to deal with. Very satisfied with the service. Delivery driver excellent. I would recommend them. Legit company.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-11-01",
        "text": "Thanks you for supporting a local family operated business. We truly appreciate your support. We look forward to seeing you in the future."
      }
    },
    {
      "id": "review_005",
      "author": "Craig Morgan",
      "rating": 5,
      "date": "2024-11-01",
      "relativeDate": "2 months ago",
      "text": "Needed a Seacan delivered same day to our job site. Called and was given options. Decided to purchase as opposed to renting. Initial call was made approx 1 pm Friday. Pictures were provided. Payment was arranged smooth transaction. 40 foot Seacan delivered to a street address before 4:30 pm same day as promised.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-11-01",
        "text": "It was our pleasure to help you find the container that fit your needs best. Glad we could help you get the delivery you needed as well with the assistance of our dedicated carriers. We look forward to serving you again!"
      }
    },
    {
      "id": "review_006",
      "author": "Dennis & Anita",
      "rating": 5,
      "date": "2024-10-01",
      "relativeDate": "3 months ago",
      "text": "Highly recommend for storage needs! Mark and Mark were awesome to deal with!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-10-01",
        "text": "We appreciate you taking time to share your thoughts on your positive rental experience. We look forward to having you with us for a long time."
      }
    },
    {
      "id": "review_007",
      "author": "Travis Behning",
      "rating": 5,
      "date": "2024-10-01",
      "relativeDate": "3 months ago",
      "text": "Great people and very easy to talk to and work with. Lots of options and accessories for c cans. Need a c can? Call c can Sam! Mark and Mark will get you what you need.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-10-01",
        "text": "Thanks for your business Travis, It's much appreciated. It was a pleasure doing business with you."
      }
    },
    {
      "id": "review_008",
      "author": "Boss Browser",
      "rating": 5,
      "date": "2024-10-01",
      "relativeDate": "3 months ago",
      "text": "Excellent customer service! Ordered a container and had it delivered the very next day!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-10-01",
        "text": "Thanks for your continued support!"
      }
    },
    {
      "id": "review_009",
      "author": "Valerie Steciuk",
      "rating": 5,
      "date": "2024-09-01",
      "relativeDate": "4 months ago",
      "text": "Mark at C Can Sam is so helpful and quick for service! He got us some very good c cans and had them shipped by a great company very quickly. Easy to deal with Definitely recommend this company!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-09-01",
        "text": "It was our pleasure to assist you in finding the best storage containers for your needs. We take pride in our products and our delivery partners. Thank you again for purchasing from a local trusted supplier!"
      }
    },
    {
      "id": "review_010",
      "author": "Evan Moir",
      "rating": 4,
      "date": "2024-09-01",
      "relativeDate": "4 months ago",
      "text": "The only thing on this can is I'm not overly happy with is how the doors close. Mite be just how some c cans are. Floor is really good.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-09-01",
        "text": "Like I mentioned you will need to place the container on a level surface, preferably with gravel for drainage. If it's placed on rail ties it will not stay level. Please try this and let me know how you make out. I'm sure it will make a significant difference in how the doors will open and close. Thanks for your business once again"
      }
    },
    {
      "id": "review_011",
      "author": "Green Prairie",
      "rating": 5,
      "date": "2024-08-01",
      "relativeDate": "5 months ago",
      "text": "We have rented and bought many containers from these Guys. Always great service and prompt replies to any questions. Highly recommend them for all your container needs!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-08-01",
        "text": "Your business is always greatly appreciated and we value your support!"
      }
    },
    {
      "id": "review_012",
      "author": "Blair Campbell",
      "rating": 5,
      "date": "2024-08-01",
      "relativeDate": "5 months ago",
      "text": "Great service and friendly guys, willing to go the extra mile for the customer is always appreciated! Highly Recommend them",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-08-01",
        "text": "Thanks for your business Mr. Campbell it was a pleasure to help you out with your storage needs"
      }
    },
    {
      "id": "review_013",
      "author": "Blair Wooff",
      "rating": 5,
      "date": "2024-08-01",
      "relativeDate": "5 months ago",
      "text": "Excellent product and service. Great communication and provided just what we wanted. Would definitely recommend.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-08-01",
        "text": "Thanks for your business Blair, it's greatly appreciated!"
      }
    },
    {
      "id": "review_014",
      "author": "Dalton Wiens",
      "rating": 5,
      "date": "2024-08-01",
      "relativeDate": "5 months ago",
      "text": "These guys were great to deal with. Took the time to show us and explain all the options. Delivery was seamless, dropped it exactly where and when I wanted it.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-08-01",
        "text": "Thanks for putting your trust in us to fulfill your container needs for your family. It was a real pleasure to deal with you. All the best"
      }
    },
    {
      "id": "review_015",
      "author": "Mike Enns",
      "rating": 5,
      "date": "2024-08-01",
      "relativeDate": "5 months ago",
      "text": "This was my second time ordering containers from Ccansam, and everything went even smoother than the first time. Pricing was good on two 20' single trip containers, and delivery went really smooth",
      "hasPhoto": false,
      "isEdited": true,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks Michael, we appreciated you reaching out to our small business for your strage needs. We look forward to working with you again."
      }
    },
    {
      "id": "review_016",
      "author": "New Tech",
      "rating": 5,
      "date": "2024-07-01",
      "relativeDate": "6 months ago",
      "text": "Excellent place to purchase a container. Service was great as well as the staff.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-07-01",
        "text": "Thanks for your purchase, we are sure it will serve you well!"
      }
    },
    {
      "id": "review_017",
      "author": "Kobe Heinrichs",
      "rating": 5,
      "date": "2024-07-01",
      "relativeDate": "6 months ago",
      "text": "Great to deal with! Quick turn around time as well. Highly recommend",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-07-01",
        "text": "We appreciate your continued support, glad we have what you're looking for!"
      }
    },
    {
      "id": "review_018",
      "author": "marcin g",
      "rating": 5,
      "date": "2024-07-01",
      "relativeDate": "6 months ago",
      "text": "Super easy to deal with. Had a great 40ft unit, nice and clean at a good price, delivered and placed right where I wanted it. Bought second one without looking at it, came in as described. Definitely worth visiting those guys!",
      "hasPhoto": true,
      "ownerResponse": {
        "date": "2024-07-01",
        "text": "Thanks for your kind words Marcin, we truly appreciate your business. We always aim for our customers success at Ccansam"
      }
    },
    {
      "id": "review_019",
      "author": "Admin Stratus Steel",
      "rating": 5,
      "date": "2024-06-01",
      "relativeDate": "7 months ago",
      "text": "Easy, quick, competitive, seamless!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-06-01",
        "text": "It was a pleasure to meet you and help you out with your purchase today. We look forward to doing business again."
      }
    },
    {
      "id": "review_020",
      "author": "Andrew Sorsdahl",
      "rating": 5,
      "date": "2024-05-01",
      "relativeDate": "8 months ago",
      "text": "They went above and beyond to accomodate a quick turnaround we requested for a cross country move when one of the other big name storage places fell through. Mark is so friendly and easy to deal with, the lot is clean and well organized, and I love that I have easy access 24/7. If you need storage in the Saskatoon/Warmen/Martinsville area, you don't need to look any further.",
      "hasPhoto": false,
      "isLocalGuide": true,
      "ownerResponse": {
        "date": "2024-05-01",
        "text": "Thanks so much for your kind words, we certainly appreciate clients like you and we're looking forward to a long working relationship"
      }
    },
    {
      "id": "review_021",
      "author": "Dave Roberts",
      "rating": 5,
      "date": "2024-05-01",
      "relativeDate": "8 months ago",
      "text": "Excellent service! Quick response and quick delivery!! Excellent product!!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-05-01",
        "text": "Thanks for your patronage and supporting a family owned business."
      }
    },
    {
      "id": "review_022",
      "author": "Grant Bachiu",
      "rating": 5,
      "date": "2024-04-01",
      "relativeDate": "9 months ago",
      "text": "The guys at Ccansam were a pleasure to deal with! They showed me a variety of containers that I could choose from. Delivery went very smoothly! Highly recommend Ccansam! Thanks",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-04-01",
        "text": "That's fantastic to hear! We certainly appreciated your business and happy to hear everything worked out well for you."
      }
    },
    {
      "id": "review_023",
      "author": "T Carter",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Great guys, honest service, very helpful delivery. I had a few sketchy experiences with other vendors, so decided to drive out and chat with Mark and Marc. We walked thru options, had a look at some cans. Changed my mind multiple times as to what I needed, they were very understanding. Finally settled on 1 40' hc and 2 40' regular cans. Walked thru the cans, with their help picked the best ones for my purpose. Delivery was great (thanks Don) even with a glitch on my part - put them on ties, when nudging them with a vehicle we pushed one off the ties! Don was great helping us reset it and continue the unloading. Use a winch or come along to move them, once they start moving they don't stop! All in all, good experience and very happy with my purchase. Recommended.",
      "hasPhoto": true,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Hi T Carter! Thanks for the fantastic review! We're glad Mark, Marc, and Don could help make your experience smooth and easy, even with a little delivery hiccup. Enjoy those containers, and we appreciate the recommendation!"
      }
    },
    {
      "id": "review_024",
      "author": "Mara Yarskie",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "We are happy with the service we received and the container.",
      "hasPhoto": true,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Hi Mara, thank you so much for your kind words! We're thrilled to hear you're happy with both the service and the container. It was a pleasure working with you, and if you ever need anything else, we're here to help! Enjoy, and thanks again for choosing us!"
      }
    },
    {
      "id": "review_025",
      "author": "Mandy Klassen",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks so much, Mandy, for the 5-star review! We're thrilled you had a great experience. Your support means a lot to us. If you need anything else, we're here to help!"
      }
    },
    {
      "id": "review_026",
      "author": "Jeff Young",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Had a seamless experience purchasing and receiving sea-can. Also providing options for offloading and on site storage was helpful",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for choosing ccansam for your storage needs. We truly appreciate your business and we look forward to future dealings"
      }
    },
    {
      "id": "review_027",
      "author": "Mackenzie Krahn",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Great experience here! We purchased a container and had it delivered extremely quickly!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thank you so much, Mackenzie! We're thrilled to hear that you had a great experience and that your container was delivered quickly. We always aim to provide fast, reliable service, so it's wonderful to know we hit the mark for you. If you ever need anything else or have any questions down the road, don't hesitate to reach out. Thanks again for choosing us!"
      }
    },
    {
      "id": "review_028",
      "author": "Lloyd R McLean",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Excellent people to deal with. So far, I have purchased 2-40 foot containers. The price was Great, the deliveries were Great and Mark and Marc are Great!!!!!! I'll be back for #3 as soon as I need it. Lloyd McLean.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for your kind words, we certainly appreciate your business and look forward to helping you with your storage needs in the future!"
      }
    },
    {
      "id": "review_029",
      "author": "Keith Kuntz",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Great to deal with, very quick delivery. Container is in great shape. Highly recommend.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks Mr.Kuntz we appreciate your support and look forward to helping again in the future"
      }
    },
    {
      "id": "review_030",
      "author": "Indy Dog",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Good guys easy to deal with. Even set up delivery for a reasonable rate",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thank you for your kind words and your support. It's greatly appreciated"
      }
    },
    {
      "id": "review_031",
      "author": "Chris Lutz",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Easy transaction, cans we as described and delivered when I needed them.",
      "hasPhoto": true,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for purchasing your containers through Ccansam, we really appreciate your business."
      }
    },
    {
      "id": "review_032",
      "author": "Al Garand",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "One call and Mark found exactly what I was looking for and handled everything from start to finish at a very reasonable price. Highly recommend Mark and Ccansam if your shopping for storage containers.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for your kind words Mr.Garand, it was a pleasure doing business with you as well. We are pleased that we were able to meet your requirements."
      }
    },
    {
      "id": "review_033",
      "author": "Roger Andersen",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Had a great experience dealing with Mark. He was very helpful and informative. I like the no bs attitude. Great communication. Very accommodating when it came to pick up",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "It was a pleasure to help you find a container suitable for your needs. Holding it for you until you were ready was not a problem. We certainly appreciate your support Roger. Thanks for your kind words"
      }
    },
    {
      "id": "review_034",
      "author": "Sheila Miller",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Mark and Mark were both very good to deal with. They were quick to respond to us with any questions we asked. We would definitely recommend CCanSam if you're looking for a storage container. Our purchase was a single trip container and it was in excellent shape. Del and Sheila Miller\n\nJust an update to my earlier review. We were able to actually see the containers we were purchasing on the lot, made the deal, and in less than 24 hours the containers were delivered to our property. The driver that came to our place (Don) was amazing. He not only just unloaded them, but was able to place them exactly where we wanted them!! This did take a lot of skill and maneuvering. How's that for service! Once again, we highly recommend CCANSAM! Del and Sheila Miller",
      "hasPhoto": false,
      "isEdited": true,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "It was our pleasure to help you find the best solution for your storage needs. Thanks for choosing Ccansam we truly appreciate your support."
      }
    },
    {
      "id": "review_035",
      "author": "Megan Green",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "100% recommend Ccansam when searching for a shipping container. I was looking for a specific container in a specific colour and everyplace I checked didn't have any and just tried to sell me what they had in stock. I went in and talked to Mark at CCansam and told him what I was looking for and he said he would find me one. In under a week he had found not only one but two and bought them both so I could have my pick. I contacted him to try to figure out I time I could come in and look at them as my schedule makes it tough during office hours. He offered to come in on the holiday Monday so I could pick my container. Both containers were in amazing condition so I have delivery scheduled for this coming weekend. Besides being extremely easy to deal with and finding exactly what I wanted, their prices were less than the competition just wanting to sell me the first one on the stack. Make sure to check these guys out if you are wanting a container!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "We definitely appreciate your business and are very excited that we could help you find just the right container for your needs. Thank you for your kind words, we look forward to helping you again in the future or your friends and family too!"
      }
    },
    {
      "id": "review_036",
      "author": "Shae Fehr",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Mark and Marc were very approachable and friendly. Sometimes as a young woman businesses of this nature can feel a bit intimidating to go to alone (if you know you know) but I felt very respected and looked after. No scammy vibes at all, felt very honest. They gave me a really good deal on a great quality can and were kind enough to hold onto it for me for a couple months while I prepared the site. I had the option of having the can delivered by just a one ton truck which saved cost on delivery as well. Highly recommend these guys!",
      "hasPhoto": true,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "We aim to make anyone who stops by to feel comfortable and important. Thanks for your kind words Shae. We appreciate your business and look forward to seeing you again."
      }
    },
    {
      "id": "review_037",
      "author": "Jeffrey Jones",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Mark was friendly, helpful and very accommodating. My container was installed same day as purchased! Highly recommend",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for choosing Ccansam for your storage needs. We truly appreciate your support."
      }
    },
    {
      "id": "review_038",
      "author": "David Neubuhr",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Dont get scamed buy from these guys, awesome servise awesome truckers, real nice containers at a great price. Very happy. Thank you c-cansam",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "We appreciate your business and value your trust in our company. Our goal is to provide a quality product for your storage needs."
      }
    },
    {
      "id": "review_039",
      "author": "Chris Klippenstein",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Excellent service and storage facility. Management went above and beyond to help us when we were in a pinch transitioning from the sale of our home. Friendly and helpful guys with great rates.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "We appreciate you choosing Ccansam for your storage needs. So glad we could help you out too!"
      }
    },
    {
      "id": "review_040",
      "author": "Lexa Doslov",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Super friendly, Great service and Quick responses! Would recommend 100%",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for choosing Ccansam for your storage needs Lexa, your support is greatly appreciated!"
      }
    },
    {
      "id": "review_041",
      "author": "Reid",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Very responsive, excellent to work with and great rates. Highly recommend",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for your kind words. We really appreciated your business and look forward to storing more for you or your family again sometime!"
      }
    },
    {
      "id": "review_042",
      "author": "Shari Gebhard",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "C-Can Sam was a great place to buy my used C-Can! They were friendly, accommodating and reliable. They allowed me to choose the C-Can that I wanted so that I was satisfied. The delivery was right on time and the C-Can was placed exactly where I wanted it to be. It was an awesome experience dealing with them!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for your kind words Shari, it was a pleasure to do business with you!"
      }
    },
    {
      "id": "review_043",
      "author": "Tyler Groat",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "They had the unit delivered and put exactly where I asked.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for your business Tyler, we appreciate your support"
      }
    },
    {
      "id": "review_044",
      "author": "Vern Parenteau",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for your business sir. We appreciated your support."
      }
    },
    {
      "id": "review_045",
      "author": "Judy Swicheniuk",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Good to deal with.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks Judy & Gerald, it was a pleasure to assist you with your purchase. We look forward to working with you again."
      }
    },
    {
      "id": "review_046",
      "author": "Tim Burns",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for your purchase Tim, we look forward to helping you out again in the future."
      }
    },
    {
      "id": "review_047",
      "author": "Slavko Hardi",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Great people to work with. They where right on time. Good price on sea cans. Highly recommend.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for your kind words, it was a pleasure doing business with you. We look forward to seeing you again!"
      }
    },
    {
      "id": "review_048",
      "author": "cheryl lorenz",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "Great service and communication. Easy to deal with via pictures, texts and calls.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for your wonderful review. We pride ourselves on making your purchase seamless."
      }
    },
    {
      "id": "review_049",
      "author": "John Fast",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "After sifting through the nonsense in my search for a container I found these guys. They had what I needed and managed the delivery - when they said they would - with no problems.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for your review John, we appreciate your support and were glad we could help you out with your storage needs."
      }
    },
    {
      "id": "review_050",
      "author": "Jackie Mensch",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "The sale was seamless and delivery was arranged for us and also went perfectly.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks for supporting a small business and we appreciate you choosing Ccansam for your storage needs."
      }
    },
    {
      "id": "review_051",
      "author": "Jason Neudorf",
      "rating": 5,
      "date": "2024-01-01",
      "relativeDate": "a year ago",
      "text": "My choice to support a local company couldn't have been better. Great communication and competitive rates make this company the Best choice. Great customer service even on a Statutory work day they get the job done. Scheduling during tight time lines made easy with no worries! Great job!",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks Jason, we really appreciate you supporting our local business. We strive to do our best offering great customer service and support. Glad we could assist you with your move."
      }
    },
    {
      "id": "review_052",
      "author": "Ron McLean",
      "rating": 5,
      "date": "2023-01-01",
      "relativeDate": "2 years ago",
      "text": "Our club rented a container for temporary storage from Ccansam. We rented a 20ft Ccan that held all equipment perfectly. The doors were easy to operate, and locked with no problem. It kept all of our stuff dry and safe. Dealing with the owners Was really easy. Just give them a call, and they will take care of your storage needs.",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks Ron, we appreciated your support and were pleased to be able to help your club out with a quick storage solution. We look forward to working with you in the future."
      }
    },
    {
      "id": "review_053",
      "author": "Sherry",
      "rating": 5,
      "date": "2023-01-01",
      "relativeDate": "2 years ago",
      "text": "Great guys to deal with. Will highly recommend them",
      "hasPhoto": false,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks Sherry, we sincerely appreciate your business and thank you for taking time to share your review. Let us know if we can be of assistance in the future."
      }
    },
    {
      "id": "review_054",
      "author": "Pat Tymchatyn",
      "rating": 5,
      "date": "2023-01-01",
      "relativeDate": "2 years ago",
      "text": "We were pleased to have a storage unit at Ccansam. It was an easy location to find, the hours were great, and everyone was friendly and helpful. I would recommend this business if you need storage at a reasonable price.",
      "hasPhoto": false,
      "isLocalGuide": true,
      "ownerResponse": {
        "date": "2024-01-01",
        "text": "Thanks Pat, it was a pleasure to help you out with your srorage needs. We look forward to serving you again."
      }
    }
  ]
}
